Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Карта
en: Map

source: Создание и удаление
en: Creating and deleting

source: Основные параметры
en: Main parameters

source: Создание карты по требованию
en: Creating maps on demand

source: Изменение размера карты
en: Resizing the map

source: Собственная карта
en: Custom map

source: Геообъекты
en: Geo objects

source: Метка
en: Placemark

source: Задание собственного изображения для метки
en: Setting a custom placemark image

source: Ломаная
en: Polyline

source: Прямоугольник
en: Rectangle

source: Многоугольник
en: Polygon

source: Круг
en: Circle

source: Стрелка на карте
en: Arrow on the map

source: Добавление геообъектов в коллекцию
en: Adding geo objects to a collection

source: Редактор ломаной
en: Polyline editor

source: Редактор многоугольника
en: Polygon editor

source: Вывод списка объектов карты
en: Outputting a list of map objects

source: События геообъекта
en: Geo object events

source: Изменение параметров метки
en: Changing placemark parameters

source: Смена значка метки при наведении
en: Changing a placemark icon when hovering over it

source: Задание фигуры активной области HTML макету метки
en: Setting the hotspot shape for a placemark's HTML layout

source: Балун и хинт
en: Balloon and hint

source: Балун, выходящий за пределы карты
en: Balloon that goes off the map

source: Динамическая загрузка содержимого балуна
en: Dynamically loading balloon content

source: Метка и балун-панель
en: Placemark and balloon panel

source: Макет хинта метки
en: Layout of the placemark hint

source: Макет балуна метки
en: Layout of the placemark balloon

source: Пользовательский макет балуна с поддержкой автопозиционирования
en: Custom layout for an autopositioned balloon

source: Элементы управления
en: Controls

source: Стандартный набор элементов управления
en: Standard set of controls

source: Добавление отдельных элементов управления
en: Adding individual controls

source: Добавление кнопки на карту
en: Adding buttons to the map

source: Произвольный макет кнопки
en: Custom button layout

source: Произвольный макет элемента изменения масштаба
en: Custom zoom control layout

source: Произвольный макет выпадающего списка
en: Custom drop-down list layout

source: Собственный элемент управления
en: Custom control

source: Активные области
en: Hotspots

source: Слой активных областей
en: Hotspot layer

source: Регионы
en: Regions

source: Пример работы модуля "Регионы"
en: Example of the "Regions" module

source: Кластеризация
en: Clustering

source: Создание кластеризатора
en: Creating the clusterer

source: Создание кластеризатора с произвольными иконками
en: Creating the clusterer with custom icons

source: Изменение цвета кластеров и меток при наведении
en: Changing the color of clusters and placemarks when hovering

source: Открытие балуна кластера с выбранным объектом
en: Opening the cluster balloon with the selected object

source: Изменение размера ячейки кластеризатора
en: Changing the clusterer cell size

source: li id="cluster_balloon_ajax">Динамическая загрузка содержимого балуна кластера</li
en: li id="cluster_balloon_ajax">Dynamically loading content of a cluster balloon</li

source: Макета балуна кластера "Две колонки"
en: "Two-column" layout for the cluster balloon

source: Макет балуна кластера "Аккордеон"
en: "Accordion" layout for the cluster balloon

source: Макета балуна кластера "Карусель"
en: "Carousel" layout for the cluster balloon

source: Собственный макет балуна кластера
en: Custom layout for the cluster balloon

source: Попадание точек в окружность
en: Points falling within a circle

source: Поиск ближайшего объекта
en: Searching for the nearest object

source: Добавление на карту объектов, попадающих в область видимости
en: Adding the objects that fall within the viewport to the map

source: Пересечение маршрута с многоугольником на примере МКАД
en: Route intersecting with a polygon, using the example of the Moscow Ring Road

source: Фильтрация объектов на карте по различным признакам
en: Filtering objects on the map using various attributes

source: Позиционирование карты для показа результатов геокодирования и их кластеризация
en: Positioning the map to display geocoding results and clustering

source: Загрузка данных с помощью JQuery и добавление их на карту
en: Uploading data using JQuery and adding it to the map

source: Поведения и события
en: Behaviors and events

source: Поведения карты
en: Map behaviors

source: Подписка на события dom-элемента
en: Subscribing to dom element events

source: Свойства события. Координаты щелчка
en: Event properties. Click coordinates

source: Использование драггера
en: Using the dragger

source: Поиск по карте
en: Search on the map

source: Прямое геокодирование
en: Forward geocoding

source: Обратное геокодирование
en: Reverse geocoding

source: Определение адреса клика на карте с помощью обратного геокодирования
en: Determining the address of a click on the map using reverse geocoding

source: Множественное геокодирование
en: Multiple geocoding

source: Поиск по своим объектам
en: Searching across your own objects

source: Собственное отображение результатов поиска
en: Custom display of search results

source: Пробки
en: Traffic

source: Элемент управления "Пробки"
en: "Traffic" control

source: Слой пробок на карте без добавления кнопки
en: Traffic layer on the map without buttons added

source: Местоположение пользователя
en: User location

source: Определение местоположения пользователя
en: Detecting user location

source: Добавление кнопки "Геолокация"
en: Adding the "Geolocation" button

source: Создание карты с местоположением пользователя
en: Creating a map with the user's location

source: Маршрутизация
en: Routing

source: Построение маршрута
en: Constructing a route

source: Редактирование маршрута
en: Editing a route

source: Расчёт стоимости маршрута
en: Calculating route cost

source: Построение мультимаршрута
en: Constructing a multiroute

source: Построение мультимаршрута на общественном транспорте
en: Constructing a multiroute on public transport

source: Построение мультимаршрута с учетом пробок
en: Constructing a multiroute considering traffic

source: Редактирование мультимаршрута
en: Editing a multiroute

source: Задание собственного отображения мультимаршрута
en: Defining a custom multiroute display

source: Задание собственного изображения иконок меток мультимаршрута
en: Setting a custom placemark icon image for a multiroute

source: Задание собственного макета балуна мультимаршрута
en: Setting a custom balloon layout for a multiroute

source: Отображение YMapsML и KML
en: Displaying YMapsML and KML

source: Добавление объектов на карту через ObjectManager
en: Adding objects to the map using ObjectManager

source: Обработка событий на объектах в ObjectManager
en: Handling events on objects in ObjectManager

source: Открытие балуна на метке в ObjectManager
en: Opening a balloon on a placemark in ObjectManager

source: Загрузка данных для балуна метки по требованию
en: Loading data for a placemark balloon on demand

source: Модульная система
en: Modular system

source: Загрузка определенных модулей при инициализации
en: Loading certain modules during initialization

source: Загрузка модуля по требованию
en: Loading a module on demand

source: Создание своего модуля
en: Creating your own module

source: Если вы используете API локально, то в URL ресурса необходимо указывать протокол в стандартном виде (http://...)
en: If you are using the API locally, you must specify the protocol in the standard form (http://...) in the resource URL.

source: Макеты объектов можно создавать с помощью фабрики [#$dp7], используя текcтовые шаблоны.
en: Object layouts can be created using the factory [#$dp7], and using text templates.

source: В данном примере создается пользовательский макет балуна геообъекта. Макет задается геообъекту через опции.
en: This example creates a custom balloon layout for a geo object. The layout is assigned to the geo object via options.

source: Для создания собственной карты необходимо прежде всего задать систему координат, на которую будет проецироваться карта. В API встроена поддержка двух систем координат: декартовой и географической, которые реализуются классами [#$dp9] и [#$dp10] соответственно. Кроме того есть возможность создания пользовательской координатной системы.
en: To create a custom map, first you must specify the coordinate system that the map will be projected on. The API supports two coordinate systems: Cartesian and geographic, which are implemented by the [#$dp9] and [#$dp10] classes, respectively. In addition, it is possible to create a custom coordinate system.

source: Также для создания пользовательской карты нужно сформировать собственный слой и добавить его в хранилище слоев карты. Для создания слоя используется класс [#$dp13]. При добавлении слоя в хранилище слоев указывается не экземпляр класса Layer, а его конструктор.
en: In addition, you need to make your own layer and add it to the map layer storage. To create a layer, use the [#$dp13] class. When adding a layer to the layer storage, do not indicate an instance of the Layer class, but its constructor.

source: Класс-модель
en: Class model

source: Используем ymaps.Monitor для наблюдения за изменениями опций модели.
en: Use ymaps.Monitor to monitor changes in the model options.

source: Хак для смены языка при смене страны.
en: Hack for switching the language when switching countries.

source: Отключение мониторинга опций модели.
en: Disabling monitoring of model options.

source: Загружаем данные.
en: Uploading data.

source: Обработчик загрузки данных.
en: The handler for loading data.

source: @param {Object} data Данные региона.
en: @param {Object} data Region data.

source: Опции модели по-умолчанию.
en: Default model options.

source: @returns {Object} Опции модели.
en: @returns {Object} Model options.

source: Класс-отображение заголовка.
en: Title display class

source: @param {jQuery} container Родителький элемент контрола.
en: @param {jQuery} container The parent element of the control.

source: Отображение данных в DOM-дереве.
en: Displaying data in the DOM tree.

source: @param {ymaps.data.Manager} data Данные регионов.
en: @param {ymaps.data.Manager} data Data for regions.

source: @returns {RegionSelector.TitleView} Возвращает ссылку на себя.
en: @returns {RegionSelector.TitleView} Returns a reference to itself.

source: Удаление данных из DOM-дерева.
en: Deleting data from the DOM tree.

source: Добавление обработчиков событий.
en: Adding event handlers.

source: Удаление обработчиков событий.
en: Deleting event handlers.

source: Обработчик клика на заголовке.
en: Handler for clicks on the header.

source: @param {jQuery.Event} e Объект-событие.
en: @param {jQuery.Event} e Event object.

source: Сервис Регионы позволяет добавлять на карту сразу целые области. Для загрузки региональных областей используется функция [#$dp9].
en: The Regions service lets you add entire regions to the map at once. Use the [#$dp9] function for uploading regional areas.

source: Данные о региональном делении стран подгружаются из OSM. Полученные данные преобразуются в коллекцию GeoObjectCollection, которую можно разместить на карте.
en: Data on the regional division of countries are loaded from OSM. The received data is converted into a GeoObjectCollection that can be placed on the map.

source: Класс-отображение списка регионов.
en: Display class for the list of regions.

source: @param {jQuery} container Родительский элемент списка.
en: @param {jQuery} container The parent element of the control.

source: @returns {RegionSelector.ListView} Возвращает ссылку на себя.
en: @returns {RegionSelector.ListView} Returns a reference to itself.

source: Сортировка DOM-элементов списка в алфавитном порядке.
en: Sorting the list of DOM elements in alphabetical order.

source: Обработчик клика на элементе списка.
en: Handler for clicks on a list item.

source: Выделить элемент списка.
en: Select a list item.

source: @param {Number} index Порядковый номер элемента в списке.
en: @param {Number} index The number of the item in the list.

source: Снять выделение элемента списка.
en: Deselect an item in the list.

source: Скроллим список к выбранному элементу.
en: Scrolling the list to the selected item.

source: Поиск (фильтрация) выбранного элемента в списке по индексу.
en: Finding (filtering) the selected item in the list by index.

source: Итератор по элементам геоколлекции.
en: An iterator for geocollection items.

source: @param {ymaps.Polygon} region Геообъект региона.
en: @param {ymaps.Polygon} region Region geo object.

source: @param {Number} index Порядковый номер элемента в геоколлекции.
en: @param {Number} index The number of the item in the geocollection.

source: Класс-отображение регионов на карте.
en: Display class for regions on the map.

source: @param {ymaps.Map} map Карта.
en: @param {ymaps.Map} map Map.

source: @constuctor
en: @constructor

source: Обработчик клика на области региона.
en: Handler for clicks on the region area.

source: @param {ymaps.data.Manager} e Менеджер данных.
en: @param {ymaps.data.Manager} e Data Manager.

source: Отображение данных на карте.
en: Displaying data on the map.

source: @param {ymaps.data.Manager} data Менеджер данных.
en: @param {ymaps.data.Manager} data Data Manager.

source: @returns {RegionSelector.MapView} Возвращает ссылку на себя.
en: @returns {RegionSelector.MapView} Returns a reference to itself.

source: Удаление данных с карты.
en: Deleting data from the map.

source: Выделяем активный регион.
en: Selecting the active region.

source: @param {Number} index Индекс региона в коллекции.
en: @param {Number} index The index of the region in the collection.

source: Снимаем выделение активного региона.
en: Removing the selection of the active region.

source: Выставляем карте область видимости на определенный регион.
en: Setting the map viewport on a certain region.

source: @param {Number} index Порядковый номер региона в геоколлекции.
en: @param {Number} index The number of the region in the geocollection.

source: Выставляем карте область видимости по всем регионам.
en: Setting the map viewport for all regions.

source: Цвет областей региона.
en: The color of the region.

source: Цвет выделенной области.
en: The color of the selected area.

source: Для отображения нужного региона выберите страну, язык и уровень детализации соответственно.
en: To display the desired region, select the appropriate country, language, and level of detail.

source: Класс-отображения контролов настроек.
en: Display class for settings controls.

source: @param {jQuery} container Родительский элемент контролов настроек.
en: @param {jQuery} container The parent of the settings controls.

source: Отображение контролов настроек в DOM-дереве.
en: Displaying settings controls in the DOM tree.

source: @returns {RegionSelector.OptsView} Возвращает ссылку на себя.
en: @returns {RegionSelector.OptsView} Returns a reference to itself.

source: Удаление контролов настроек из DOM-дерева.
en: Removing the settings controls from the DOM tree.

source: Обработчик клика на конроле настроек.
en: Click handler on a settings control.

source: Выделить элемент списка контрола.
en: Select item in the control list.

source: @param {jQuery} item Элемент списка контрола.
en: @param {jQuery} item Control list item.

source: Снять выделение элемента списка контрола.
en: Deselect item in the control list.

source: @param {jQuery} container Родительский элемент.
en: @param {jQuery} container Parent element.

source: Заголовки контролов.
en: Titles of controls.

source: Класс-контрол выбора региона
en: Region selection control class

source: @param {jQuery} listContainer Контейнер списка областей.
en: @param {jQuery} listContainer Container for the list of areas.

source: @param {jQuery} optContainer Контейнер для настроек.
en: @param {jQuery} optContainer Container for settings.

source: @param {jQuery} titleContainer Контейнер заголовка.
en: @param {jQuery} titleContainer Container for the title.

source: Обработчик события загрузки данных о регионах.
en: The event handler for loading regional data.

source: Обработчик выбора региона на карте.
en: Handler for selecting a region on the map.

source: Обработчик выбора региона в списке.
en: Handler for selecting a region in the list.

source: Обработчик смены настроек.
en: Handler for changing settings.

source: Класс-отображение данных на карте ввиде маски.
en: Class for displaying data on the map as a mask.

source: @returns {RegionSelector.MapMaskView} Возвращает ссылку на себя.
en: @returns {RegionSelector.MapMaskView} Returns a reference to itself.

source: Обработчик события изменения пискельной геометрии.
en: Event handler for changes to pixel geometry.

source: Обработчик события окончания плавного движения карты.
en: Event handler for the end of smooth map movement.

source: Создание геометрии типа "Polygon".
en: Creating a "Polygon" type geometry.

source: @param {Number[][]} coordinates Координаты вершин ломаных, определяющих внешнюю и внутренние границы многоугольника.
en: @param {Number[][]} coordinates The coordinates of the polyline vertices defining the external and internal boundaries of the polygon.

source: Создание оверлея.
en: Creating an overlay.

source: @param Пиксельная геометрия полигона.
en: @param Polygon pixel geometry.

source: Опции по-умолчанию.
en: Default options.

source: @returns {Object} Опции.
en: @returns {Object} Options.

source: Класс оверлея маски.
en: Overlay mask class.

source: @param Пиксельная геометкрия полигона.
en: @param Polygon pixel geometry.

source: @param {Object} data Данные.
en: @param {Object} data Data.

source: @param {Object} options Опции.
en: @param {Object} options Options.

source: Перекрываем публичный метод.
en: Overriding the public method.

source: Создание пиксельной геометрии.
en: Creating the pixel geometry.

source: @returns {ymaps.geometry.pixel.Polygon} Пиксельная геометрия полигона.
en: @returns {ymaps.geometry.pixel.Polygon} Polygon pixel geometry.

source: Свойства.
en: Properties.

source: Ширина линии.
en: Line width.

source: Цвет обводки.
en: Stroke color.

source: Прозрачность обводки.
en: Stroke transparency.

source: Примеры. Прямое геокодирование
en: Examples. Forward geocoding

source: Правила отображения маршрутов задаются в опциях маршрутизатора.
en: Rules for displaying routes are set in the router options.

source: Для задания опций составных частей мультимаршрута доступны следующие префиксы:
en: The following prefixes are available for setting options for sections of a multiroute:

source: В данном примере на карту добавляется два маршрута с разными опциями отображения. Как можно задать два разных отображения для маршрутов, имеющих общую модель, см. в справочнике.
en: In this example, two routes are added to the map with different display options. To set two different displays for routes that share the same model, see the Reference guide.

source: Создание мультимаршрута.
en: Creating a multiroute.

source: @param {Object} model Модель маршрута. Задается объектом с полями: referencePoints и params. referencePoints - описание опорных точек мультимаршрута (обязательное поле); params - параметры мультимаршрута.
en: @param {Object} model Route model. Set as an object with the fields referencePoints and params. referencePoints is a description of the reference points of the multiroute (mandatory field); params is the parameters of the multiroute.

source: @param {Object} [options] Опции маршрута.
en: @param {Object} [options] Route options.

source: Точки с указанными индексами будут трактоваться как транзитные.
en: The points with the specified indexes will be treated as thru points.

source: Радиус транзитных точек на маршруте.
en: The radius of the transit points on the route.

source: Радиус точечных маркеров в путевых точках.
en: The radius of the point markers at waypoints.

source: Примеры. Задание собственного отображения маршрута
en: Examples. Setting a custom route display

source: Создаем собственный макет с информацией о выбранном геообъекте.
en: Creating a custom layout with information about the selected geo object.

source: Флаг "raw" означает, что данные вставляют "как есть" без экранирования html.
en: The "raw" flag means that data is inserted "as is" without escaping HTML.

source: Устанавливаем режим открытия балуна. В данном примере балун никогда не будет открываться в режиме панели.
en: Setting the mode for opening the balloon. In this example, the balloon will never open in the panel mode.

source: Устанавливаем собственный макет.
en: Setting a custom layout.

source: Заполняем кластер геообъектами со случайными позициями.
en: Populating the cluster with geo objects with random positions.

source: Устаналиваем данные, которые будут отображаться в балуне.
en: Defining the data that will be displayed in the balloon.

source: Для объединения близко расположенных меток в группу (кластер) используется кластеризатор.
en: The clusterer is used for combining closely positioned placemarks in a group (cluster).

source: Кластеризатор реализуется классом [#$dp12]. В качестве параметров конструктору можно передать опции кластеризатора: стиль отображения значка кластера, размер его ячейки и т. д. Список доступных опций можно посмотреть в соответствующем разделе справочника.
en: The clusterer is implemented by the [#$dp12] class. You can pass clusterer options to the constructor as parameters: the display style for the cluster icon, the cell size, and so on. For the list of available options, see the relevant section of the Reference Guide.

source: Для добавления геообъектов в кластеризатор используется метод add. В качестве параметра может быть передан как отдельный геообъект, так и массив геообъектов.
en: To add geo objects to the clusterer, use the add method. Either a separate geo object or an array of geo objects can be passed as the parameter.

source: Содержимое балуна может подгружаться динамически. Для этого в callback-функции AJAX-запроса нужно всего лишь переопределить свойство геообъекта, отвечающее за содержимое балуна. Балун автоматически обновит своё содержимое и размеры.
en: The contents of the balloon can be loaded dynamically. In the callback function of the AJAX request, you need to override the property of the geo object responsible for the balloon content. The balloon will automatically update its content and size.

source: В качестве примера AJAX-запроса использован механизм геокодирования в API.
en: As an example of an AJAX request, we use the geocoding mechanism in the API.

source: Объекты, добавленные в ObjectManager, располагаются в коллекции ObjectManager.objects. Кластеры, образованные из добавленных меток, добавляются в коллекцию ObjectManager.clusters. Визуальное отображение меток создается по требованию асинхронно. Визуальным отображением меток и кластеров являются объекты, реализующие интерфейс [#$dp10]. В частности, [#$dp11]. Оверлеи помещаются в коллекции ObjectManager.objects.overlays и ObjectManager.clusters.overlays соответственно.
en: Objects added in ObjectManager are in the ObjectManager.objects collection. The clusters formed from the added placemarks are added to the ObjectManager.clusters collection. The visual display of placemarks is created asynchronously on request. Placemarks and clusters are visually displayed as objects that implement the [#$dp10] interface. In particular, [#$dp11]. Overlays are placed in the ObjectManager.objects.overlays and ObjectManager.clusters.overlays collections, respectively.

source: Чтобы метки начали кластеризоваться, выставляем опцию.
en: Setting an option to make placemarks start clusterizing.

source: Let Target be the this value.
en: Let Target be this value.
